Repository: hibataha0/filevo
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appTitle
source: Flievo
ar: فليڤو

# loginSubtitle
source: Login to your account
ar: سجّل الدخول إلى حسابك

source: Username or Email
ar: اسم المستخدم أو البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Forgot Password?
ar: هل نسيت كلمة المرور؟

source: Sign In
ar: تسجيل الدخول

source: Sign in with
ar: تسجيل الدخول باستخدام

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign up
ar: إنشاء حساب

source: Login successful!
ar: تم تسجيل الدخول بنجاح!

source: Invalid credentials
ar: بيانات الاعتماد غير صحيحة

source: Create account
ar: إنشاء حساب

source: Username
ar: اسم المستخدم

source: Email
ar: البريد الإلكتروني

source: Mobile
ar: رقم الهاتف

source: Confirm Password
ar: تأكيد كلمة المرور

source: Create
ar: إنشاء

source: Sign up with
ar: إنشاء حساب باستخدام

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب بالفعل؟

source: Log In
ar: تسجيل الدخول

source: Account created successfully!
ar: تم إنشاء الحساب بنجاح!

# enterUsernameOrEmail
source: Please enter your username or email
ar: الرجاء إدخال اسم المستخدم أو البريد الإلكتروني

# invalidEmail
source: Please enter a valid email address
ar: الرجاء إدخال بريد إلكتروني صالح

# enterUsername
source: Please enter your username
ar: الرجاء إدخال اسم المستخدم

# usernameMin
source: Username must be at least 3 characters
ar: يجب أن يكون اسم المستخدم 3 أحرف على الأقل

# usernameMax
source: Username cannot exceed 20 characters
ar: يجب ألا يتجاوز اسم المستخدم 20 حرفًا

# usernameAllowedChars
source: Username can only contain letters, numbers and underscore
ar: يمكن أن يحتوي اسم المستخدم على أحرف وأرقام وشرطة سفلية فقط

# enterPassword
source: Please enter your password
ar: الرجاء إدخال كلمة المرور

# passwordMin
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل

# enterConfirmPassword
source: Please confirm your password
ar: يرجى تأكيد كلمة المرور

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# enterPhone
source: Please enter your phone number
ar: الرجاء إدخال رقم الهاتف

# invalidPhone
source: Please enter a valid phone number (10-15 digits)
ar: الرجاء إدخال رقم هاتف صالح (10-15 رقمًا)

source: Recent Folders
ar: المجلدات الحديثة

source: See all
ar: عرض الكل

source: Recent Files
ar: الملفات الحديثة

# storageUsed
source: Used
ar: المستخدم

source: Free Internal
ar: المساحة الداخلية المتاحة

# freeInternalValue
source: 120.5 GB
ar: 120.5 جيجابايت

# usedStorageValue
source: 149.5 GB
ar: 149.5 جيجابايت

# searchHint
source: Search anything here
ar: ابحث هنا عن أي شيء

source: All
ar: الكل

source: My Files
ar: ملفاتي

source: Shared
ar: مشتركة

source: All Items
ar: جميع العناصر

source: My Folders
ar: مجلداتي

source: Shared Files
ar: الملفات المشتركة

# sharedFilesContent
source: Shared files content will be here
ar: سيتم عرض الملفات المشتركة هنا

source: Filter
ar: تصفية

source: Images
ar: صور

source: Videos
ar: فيديوهات

source: Audio
ar: صوتيات

source: Compressed
ar: مضغوط

source: Applications
ar: تطبيقات

source: Documents
ar: مستندات

source: Code
ar: رمز/كود

source: Other
ar: أخرى

source: Type
ar: النوع

# timeAndDate
source: Time & Date
ar: الوقت والتاريخ

source: Yesterday
ar: أمس

source: Last 7 days
ar: آخر 7 أيام

source: Last 30 days
ar: آخر 30 يومًا

source: Last year
ar: العام الماضي

source: Custom
ar: مخصص

source: Used
ar: مستخدم

source: Storage Overview
ar: نظرة عامة على التخزين

source: Used storage:
ar: التخزين المستخدم:

source: Settings
ar: الإعدادات

source: Choose Language
ar: اختر اللغة

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: General
ar: عام

source: General Settings
ar: إعدادات عامة

source: Basic app settings
ar: الإعدادات الأساسية للتطبيق

source: Dark Mode
ar: الوضع الداكن

# switchThemes
source: Switch between themes
ar: تبديل بين السمات

source: Language
ar: اللغة

source: Preferences
ar: تفضيلات

source: Notifications
ar: الإشعارات

source: Manage notifications
ar: إدارة الإشعارات

source: Storage
ar: التخزين

source: Manage storage settings
ar: إدارة إعدادات التخزين

source: Privacy & Security
ar: الخصوصية والأمان

source: Privacy settings
ar: إعدادات الخصوصية

source: Support
ar: الدعم

source: Legal & Policies
ar: القوانين والسياسات

# termsPrivacyPolicy
source: Terms of service & privacy policy
ar: شروط الخدمة وسياسة الخصوصية

source: Help & Support
ar: المساعدة والدعم

# getHelpSupport
source: Get help and support
ar: الحصول على المساعدة والدعم

source: About
ar: حول

# appVersion
source: App version {version}
ar: إصدار التطبيق {version}

source: Logout
ar: تسجيل الخروج

# signOut
source: Sign out from your account
ar: تسجيل الخروج من حسابك

source: Reset Password
ar: إعادة تعيين كلمة المرور

# forgotPasswordTitle
source: Forgot your password?
ar: هل نسيت كلمة المرور؟

# forgotPasswordSubtitle
source: Enter your email address and we'll send you a code to reset your password.
ar: أدخل بريدك الإلكتروني وسنرسل لك رمزًا لإعادة تعيين كلمة المرور.

source: Send Code
ar: إرسال الرمز

# enterEmail
source: Please enter your email
ar: يرجى إدخال بريدك الإلكتروني

# validEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صالح

# codeSent
source: Code sent successfully
ar: تم إرسال الرمز بنجاح

# failedSendCode
source: Failed to send code
ar: فشل في إرسال الرمز

source: Back to Login
ar: العودة لتسجيل الدخول

# verifyCodeTitle
source: Verify Code
ar: التحقق من الرمز

# enter6DigitCode
source: Please enter a 6-digit code
ar: الرجاء إدخال رمز مكون من 6 أرقام

# enterCodeToEmail
source: Enter the 6-digit code sent to {email}
ar: أدخل الرمز المكون من 6 أرقام المرسل إلى {email}

source: Verify
ar: تحقق

source: Resend Code
ar: إعادة إرسال الرمز

# codeVerified
source: Code verified successfully
ar: تم التحقق من الرمز بنجاح

# invalidOrExpiredCode
source: The code is invalid or has expired
ar: الرمز غير صالح أو منتهي الصلاحية

# codeResent
source: Code resent successfully
ar: تم إعادة إرسال الرمز بنجاح

# failedResendCode
source: Failed to resend code
ar: فشل في إعادة إرسال الرمز

# mustLogin
source: You must log in first
ar: يجب تسجيل الدخول أولاً

source: Error fetching data
ar: خطأ في جلب البيانات

# loginRequiredToAccessFiles
source: You must log in to access the files
ar: يجب تسجيل الدخول للوصول إلى الملفات

source: Retry
ar: إعادة المحاولة

# noFilesInCategory
source: No files in this category.
ar: لا توجد ملفات في هذا التصنيف.

source: Updated
ar: تحديث

source: Number of files:
ar: عدد الملفات:

# upload_success
source: File uploaded successfully
ar: تم رفع الملف بنجاح

source: Create Folder
ar: إنشاء مجلد

# folderNameHint
source: Folder Name
ar: اسم المجلد

# enterFolderName
source: Please enter folder name
ar: الرجاء إدخال اسم المجلد

source: Cancel
ar: إلغاء

source: File ID not available
ar: معرف الملف غير متوفر

# fileAlreadyAccessed
source: You have already accessed this file. One-time share only.
ar: لقد فتحت هذا الملف من قبل. الملف مشترك لمرة واحدة فقط.

# oneTimeShareAccessRecorded
source: This file is shared for one time - your access has been recorded
ar: هذا الملف مشترك لمرة واحدة - تم تسجيل وصولك

source: Cannot access file
ar: لا يمكن الوصول إلى الملف

source: Error accessing file
ar: خطأ في الوصول إلى الملف

source: File URL not available
ar: رابط الملف غير متوفر

source: Invalid URL
ar: رابط غير صالح

source: Unsupported File
ar: ملف غير مدعوم

# invalidPdfFile
source: This file is not a valid PDF or may be corrupted.
ar: هذا الملف ليس PDF صالح أو قد يكون تالفاً.

source: Open as Text
ar: فتح كنص

source: Share File with Room
ar: مشاركة الملف مع غرفة

# chooseRoomToShare
source: Choose a room to share this file
ar: اختر غرفة لمشاركة هذا الملف

source: No rooms available
ar: لا توجد غرف متاحة

# createRoomFirst
source: Create a room first to share
ar: قم بإنشاء غرفة أولاً للمشاركة

source: One-time Share
ar: مشاركة لمرة واحدة

# oneTimeShareDescription
source: Each user can open the file only once
ar: يمكن لكل مستخدم فتح الملف مرة واحدة فقط

# expiresInHours
source: Expires in {hours} hours
ar: ينتهي خلال {hours} ساعة

# enterHours
source: Enter number of hours
ar: أدخل عدد الساعات

source: Confirm
ar: تأكيد

source: Share
ar: مشاركة

# fileAlreadyShared
source: This file is already shared with this room
ar: هذا الملف مشترك بالفعل مع هذه الغرفة

source: Room Details
ar: تفاصيل الغرفة

# onlyOwnerCanDelete
source: Only room owner can delete it
ar: فقط مالك الغرفة يمكنه حذفها

# ownerCannotLeave
source: Room owner cannot leave. Please delete the room instead
ar: مالك الغرفة لا يمكنه مغادرتها. يرجى حذف الغرفة بدلاً من ذلك

source: Delete Room
ar: حذف الغرفة

source: Leave Room
ar: مغادرة الغرفة

# deleteRoomConfirm
source: Are you sure you want to delete "{roomName}"? All shared files and folders will also be deleted.
ar: هل أنت متأكد من حذف "{roomName}"؟ سيتم حذف جميع البيانات المرتبطة بالغرفة.

# leaveRoomConfirm
source: Are you sure you want to leave "{roomName}"? You will not be able to access this room after leaving.
ar: هل أنت متأكد من مغادرة "{roomName}"؟ لن تتمكن من الوصول إلى هذه الغرفة بعد المغادرة.

# roomNamePlaceholder
source: No name
ar: بدون اسم

source: Leave
ar: مغادرة

source: Owner
ar: المالك

source: Members
ar: أعضاء

source: Files
ar: ملفات

source: Folders
ar: مجلدات

source: Send Invitation
ar: إرسال دعوة

source: Comments
ar: التعليقات

source: Room Info
ar: معلومات الغرفة

source: Created at
ar: أنشئت في

source: Last modified
ar: آخر تعديل

source: View All
ar: عرض الكل

source: No members
ar: لا يوجد أعضاء

source: Shared Files ({count})
ar: الملفات المشتركة ({count})

source: Files count
ar: عدد الملفات

source: Add File
ar: إضافة ملف

source: Add File to Room
ar: إضافة ملف للغرفة

source: OK
ar: موافق

source: Add Folder
ar: إضافة مجلد

source: Add Folder to Room
ar: إضافة مجلد للغرفة

# folderIdNotAvailable
source: ❌ Error: Folder ID not available.
ar: ❌ خطأ: معرف المجلد غير متوفر.

source: Failed to load room details
ar: فشل تحميل تفاصيل الغرفة

source: Error loading room details
ar: خطأ في تحميل تفاصيل الغرفة

source: Profile
ar: الملف الشخصي

source: Edit Username
ar: تعديل اسم المستخدم

source: Edit Email
ar: تعديل البريد الإلكتروني

source: Change Password
ar: تغيير كلمة المرور

source: Current Password
ar: كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

# currentPasswordRequired
source: Current password is required
ar: كلمة المرور الحالية مطلوبة

# newPasswordRequired
source: New password is required
ar: كلمة المرور الجديدة مطلوبة

# passwordConfirmationRequired
source: Password confirmation is required
ar: تأكيد كلمة المرور مطلوب

# passwordMinLength
source: Password must be at least 8 characters
ar: كلمة المرور يجب أن تكون 8 أحرف على الأقل

# fieldRequired
source: This field is required
ar: هذا الحقل مطلوب

# validEmailRequired
source: Invalid email address
ar: البريد الإلكتروني غير صحيح

source: ✅ Updated successfully
ar: ✅ تم التحديث بنجاح

source: ✅ Password updated successfully
ar: ✅ تم تحديث كلمة المرور بنجاح

source: Trash
ar: المهملات

source: Deleted Files
ar: الملفات المحذوفة

source: Deleted Folders
ar: المجلدات المحذوفة

# tokenNotFound
source: ❌ Error: Token not found
ar: ❌ خطأ: لم يتم العثور على الرمز المميز

# logoutSuccess
source: ✅ Logged out successfully
ar: ✅ تم تسجيل الخروج بنجاح

source: No shared files
ar: لا توجد ملفات مشتركة

source: Share Files with Room
ar: مشاركة الملفات مع الغرفة

source: File
ar: ملف

source: Viewed by all
ar: شوهد من الجميع

source: Active
ar: نشط

source: Accessed
ar: تم الوصول

source: Completed
ar: اكتمل

source: Shared by
ar: شاركه

source: Modified
ar: عدل

source: Download
ar: تحميل

source: Save to My Account
ar: حفظ في حسابي

source: Save
ar: حفظ

# cannotAddSharedFilesToFavorites
source: Cannot add shared files in room to favorites
ar: لا يمكن إضافة الملفات المشتركة في الروم إلى المفضلة

source: No name
ar: بدون اسم

source: File without name
ar: ملف بدون اسم

source: No recent folders
ar: لا توجد مجلدات حديثة

source: No recent files
ar: لا توجد ملفات حديثة

source: Folder
ar: مجلد

source: No items
ar: لا توجد عناصر

source: One item
ar: عنصر واحد

source: item
ar: عنصر

source: items
ar: عناصر

source: File saved successfully
ar: تم حفظ الملف بنجاح

# fileSavedAndUploaded
source: File saved and uploaded to server successfully
ar: تم حفظ الملف ورفعه إلى السيرفر بنجاح

# fileSavedLocallyOnly
source: File saved locally only. Please try again to upload to server
ar: تم حفظ الملف محلياً فقط. يرجى المحاولة مرة أخرى لرفعه على السيرفر

source: Failed to save file
ar: فشل حفظ الملف

source: Unsaved changes
ar: تغييرات غير محفوظة

# unsavedChangesMessage
source: You have unsaved changes. Do you want to exit without saving?
ar: لديك تغييرات غير محفوظة. هل تريد الخروج دون حفظ؟

source: Exit
ar: خروج

source: Edit
ar: تحرير

source: Copy Content
ar: نسخ المحتوى

source: Access token not found
ar: لم يتم العثور على رمز الوصول

source: File is empty
ar: الملف فارغ

source: Loading file data...
ar: جاري تحميل بيانات الملف...

source: Failed to load file data
ar: فشل في تحميل بيانات الملف

# fileInfo
source: File Information
ar: معلومات الملف

source: Category
ar: التصنيف

source: Extension
ar: الامتداد

source: Size
ar: الحجم

source: Description
ar: الوصف

source: Tags
ar: الوسوم

source: Share with Room
ar: مشاركة مع غرفة

source: Share feature coming soon
ar: ميزة المشاركة قريباً

source: Image
ar: صورة

source: Video
ar: فيديو

source: Document
ar: مستند

source: Failed to load preview
ar: تعذر تحميل المعاينة

source: Unclassified
ar: غير مصنف

source: Extracting text from PDF...
ar: جارٍ استخراج النص من PDF...

# pdfTextExtractionNote
source: Note: Text extraction may not be available for all PDF files.
ar: ملاحظة: قد لا يكون استخراج النص متاحاً لجميع ملفات PDF.

# pdfTextExtractionNote2
source: You can select and highlight text after extraction.
ar: يمكنك تحديد النص وتظليله بعد الاستخراج.

source: Status
ar: الحالة

# youAreOwner
source: You are the owner
ar: أنت المالك

source: Shared file
ar: ملف مشترك

source: Unshare File
ar: إلغاء مشاركة الملف

# unshareFileConfirm
source: Are you sure you want to remove sharing?
ar: هل أنت متأكد من إلغاء مشاركة هذا الملف مع جميع المستخدمين؟

source: Unshare
ar: إلغاء المشاركة

# mustLoginFirst
source: You must login first
ar: يجب تسجيل الدخول أولاً

source: Folder Info
ar: معلومات المجلد

source: Subfolders count
ar: عدد المجلدات الفرعية

source: Creation date
ar: تاريخ الإنشاء

source: Folder without name
ar: مجلد بدون اسم

# pleaseEnter6DigitCode
source: Please enter the 6-digit verification code
ar: الرجاء إدخال رمز التحقق المكون من 6 أرقام

source: ✅ Account activated successfully
ar: ✅ تم تفعيل الحساب بنجاح

# invalidVerificationCode
source: Verification code is incorrect
ar: رمز التحقق غير صحيح

# pleaseWaitBeforeResend
source: Please wait {seconds} seconds before resending
ar: الرجاء الانتظار {seconds} ثانية قبل إعادة الإرسال

# verificationCodeSent
source: Verification code has been sent to your email
ar: ✅ تم إرسال رمز التحقق بنجاح

# failedToResendCode
source: ❌ Failed to resend verification code
ar: ❌ فشل إعادة إرسال رمز التحقق

source: Email Verification
ar: التحقق من البريد الإلكتروني

# verificationCodeSentTo
source: Verification code sent to {email}
ar: تم إرسال رمز التحقق إلى {email}

# didNotReceiveCode
source: Didn't receive the code?
ar: لم تستلم الرمز؟

source: Resend
ar: إعادة الإرسال

# resendWithCountdown
source: Resend ({seconds})
ar: إعادة الإرسال ({seconds})

# searchError
source: Search error: {error}
ar: خطأ في البحث: {error}

source: Load More
ar: تحميل المزيد

source: File not available: {error}
ar: الملف غير متاح (خطأ {error})

# errorLoadingFile
source: Error loading file: {error}
ar: خطأ في تحميل الملف: {error}

# featureUnderDevelopment
source: This feature is under development
ar: هذه الميزة قيد التطوير

source: Moving file...
ar: جاري نقل الملف...

source: Updating...
ar: جاري التحديث...

source: Moving folder...
ar: جاري نقل المجلد...

# errorFetchingSubfolders
source: Error fetching subfolders: {error}
ar: خطأ في جلب المجلدات الفرعية: {error}

source: Move to Root
ar: نقل إلى الجذر

source: Move Folder to Root
ar: نقل المجلد إلى الجذر

source: Move to this folder
ar: نقل إلى هذا المجلد

source: Edit File
ar: تعديل الملف

source: Open Image Editor
ar: فتح محرر الصور

source: Reload Original Image
ar: إعادة تحميل الصورة الأصلية

source: Open Text Editor
ar: فتح محرر النص

source: Failed to load image
ar: فشل تحميل الصورة

# failedToSaveTempImage
source: Failed to save temporary image
ar: فشل حفظ الصورة المؤقتة

source: Loaded image is empty
ar: الصورة المحملة فارغة

# errorVerifyingImage
source: Error verifying image: {error}
ar: خطأ في التحقق من الصورة: {error}

# error
source: Error: {error}
ar: خطأ: {error}

source: Loading video...
ar: جاري تحميل الفيديو...

# failedToLoadVideo
source: Failed to load video ({statusCode})
ar: فشل تحميل الفيديو ({statusCode})

# failedToSaveTempVideo
source: Failed to save temporary video
ar: فشل حفظ الفيديو المؤقت

source: Loaded video is empty
ar: الفيديو المحمل فارغ

# errorVerifyingVideo
source: Error verifying video: {error}
ar: خطأ في التحقق من الفيديو: {error}

source: Extracting image...
ar: جاري استخراج الصورة...

source: Image extracted
ar: تم استخراج الصورة

# saveThisImage
source: Do you want to save this image?
ar: هل تريد حفظ هذه الصورة؟

source: Failed to extract image
ar: فشل استخراج الصورة

# mergingVideos
source: Merging videos... This may take some time
ar: جاري دمج المقاطع... قد يستغرق بعض الوقت

source: Failed to merge videos
ar: فشل دمج المقاطع

# failedToLoadAudio
source: Failed to load audio file ({statusCode})
ar: فشل تحميل الملف الصوتي ({statusCode})

# failedToSaveTempAudio
source: Failed to save temporary audio file
ar: فشل حفظ الملف الصوتي المؤقت

# loadedAudioIsEmpty
source: Loaded audio file is empty
ar: الملف الصوتي المحمل فارغ

source: Start time must be before end time
ar: وقت البداية يجب أن يكون قبل وقت النهاية

source: Failed to load audio file
ar: فشل تحميل الملف الصوتي

# failedToLoadBaseAudio
source: Failed to load base audio file
ar: فشل تحميل الملف الصوتي الأساسي

# mustSelectAtLeastTwoAudioFiles
source: You must select at least two audio files to merge
ar: يجب اختيار ملفين صوتيين على الأقل للدمج

# mergingAudioFiles
source: Merging audio files... This may take some time
ar: جاري دمج الملفات الصوتية... قد يستغرق بعض الوقت

source: Edit Image
ar: تعديل الصورة

source: Image edited
ar: تم تعديل الصورة

source: Edit Text
ar: تعديل النص

source: Text edited
ar: تم تعديل النص

source: Failed to load PDF
ar: فشل تحميل ملف PDF

source: Failed to load file
ar: فشل تحميل الملف

source: Choose time to extract image
ar: اختر الوقت لاستخراج الصورة

source: Choose time in seconds:
ar: اختر الوقت بالثواني:

# failedToLoadPdfFile
source: Failed to load PDF file: {error}
ar: فشل تحميل ملف PDF: {error}

# failedToLoadPdfForDisplay
source: Failed to load PDF for display: {error}
ar: فشل تحميل PDF للعرض: {error}

# textHighlighted
source: Selected text highlighted
ar: تم تظليل النص المحدد

source: Search in PDF
ar: البحث في PDF

# forAdvancedSearchFeature
source: To benefit from advanced search feature, we recommend using:
ar: للاستفادة من ميزة البحث المتقدمة، نوصي باستخدام:

source: Current version supports:
ar: الإصدار الحالي يدعم:

source: Loading file...
ar: جاري تحميل الملف...

source: Extracting text...
ar: جارٍ استخراج النص...

source: Text not extracted yet
ar: لم يتم استخراج النص بعد

source: Extract Text
ar: استخراج النص

# searchInPdfNotAvailableMessage
source: PDF search is not currently available. You can open the file in an external app to search.
ar: البحث في PDF غير متاح حالياً. يمكنك فتح الملف في تطبيق خارجي للبحث.

source: File not loaded
ar: لم يتم تحميل الملف

source: Highlight selected text
ar: تظليل النص المحدد

source: Remove all highlights
ar: إزالة جميع التظليلات

source: Highlights
ar: تظليل

source: Please login again
ar: يرجى إعادة تسجيل الدخول

# failedToOpenFile
source: Failed to open file: {error}
ar: فشل فتح الملف: {error}

# failedToLoadFileStatus
source: Failed to load file status: {error}
ar: فشل تحميل الملف: {error}

# errorOpeningFile
source: Error opening file: {error}
ar: خطأ في فتح الملف: {error}

# fileNotValidPdf
source: File is not a valid PDF
ar: الملف ليس ملف PDF صالح

source: Remove File from Room
ar: إزالة الملف من الروم

# removeFileFromRoomConfirm
source: Are you sure you want to remove "{fileName}" from this room?
ar: هل أنت متأكد من إزالة "{fileName}" من هذه الغرفة؟

# confirmRemoveFileFromRoom
source: Are you sure you want to remove this file from the room?
ar: هل أنت متأكد من إزالة هذا الملف من الغرفة؟

source: Remove Folder from Room
ar: إزالة المجلد من الغرفة

# confirmRemoveFolderFromRoom
source: Are you sure you want to remove this folder from the room?
ar: هل أنت متأكد من إزالة هذا المجلد من الغرفة؟

source: Remove Member
ar: إزالة العضو

# confirmRemoveMember
source: Are you sure you want to remove {memberName} from the room?
ar: هل أنت متأكد من إزالة {memberName} من الغرفة؟

source: Remove
ar: إزالة

source: Room Members
ar: أعضاء الغرفة

source: Failed to load room data
ar: فشل تحميل بيانات الغرفة

# pleaseSelectFileOrFolder
source: Please select a file or folder
ar: الرجاء اختيار ملف أو مجلد

source: Delete Comment
ar: حذف التعليق

# confirmDeleteComment
source: Are you sure you want to delete this comment?
ar: هل أنت متأكد من حذف هذا التعليق؟

source: Delete
ar: حذف

source: Room
ar: الغرفة

source: Create New Folder
ar: إنشاء مجلد جديد

source: Saving folder...
ar: جاري حفظ المجلد...

source: Save to Root
ar: حفظ في الجذر

# confirmRemoveFolderFromRoomWithName
source: Are you sure you want to remove the folder '{folderName}' from the room?
ar: هل أنت متأكد من إزالة المجلد '{folderName}' من الغرفة؟

source: Share Folder with Room
ar: مشاركة المجلد مع الغرفة

source: Share with this room
ar: مشاركة مع هذه الغرفة

source: Create New Share Room
ar: إنشاء غرفة مشاركة جديدة

source: Please enter room name
ar: الرجاء إدخال اسم الغرفة

source: View Only
ar: عرض فقط

# viewOnlyDescription
source: User can only view files
ar: يمكن للمستخدم عرض الملفات فقط

source: Editor
ar: محرر

# editorDescription
source: User can edit files
ar: يمكن للمستخدم تحرير الملفات

source: Commenter
ar: معلق

# commenterDescription
source: User can comment on files
ar: يمكن للمستخدم التعليق على الملفات

source: Reject Invitation
ar: رفض الدعوة

# confirmRejectInvitation
source: Are you sure you want to reject this invitation?
ar: هل أنت متأكد من رفض هذه الدعوة؟

source: Reject
ar: رفض

source: Pending Invitations
ar: الدعوات المعلقة

source: Accept
ar: قبول

source: File link not available
ar: رابط الملف غير متوفر

# openFileAsText
source: Open file as text: {fileName}
ar: فتح الملف كنص: {fileName}

source: Favorite Files
ar: الملفات المفضلة

source: No favorite files
ar: لا توجد ملفات مفضلة

source: Add files to favorites
ar: أضف الملفات إلى المفضلة

source: Activity Log
ar: سجل النشاط

source: Previous
ar: السابق

source: Next
ar: التالي

source: Filter Activity
ar: تصفية النشاط

source: Upload File
ar: رفع ملف

source: Download File
ar: تحميل ملف

source: Delete File
ar: حذف ملف

source: Share File
ar: مشاركة ملف

source: Login
ar: تسجيل الدخول

source: System
ar: النظام

source: Reset
ar: إعادة تعيين

source: Microphone permission required
ar: إذن الميكروفون مطلوب

source: Open Settings
ar: فتح الإعدادات

source: Permission denied
ar: تم رفض الإذن

source: Must allow microphone access
ar: يجب السماح بالوصول إلى الميكروفون

source: Speech recognition not available
ar: التعرف على الصوت غير متاح

source: Enter search text
ar: أدخل نص البحث

source: Smart Search
ar: البحث الذكي

source: File link not available (no path)
ar: رابط الملف غير متوفر (لا يوجد مسار)

# failedToCreateTempFile
source: Failed to create temporary file
ar: فشل إنشاء ملف مؤقت

# errorLoadingTextFile
source: Error loading text file: {error}
ar: خطأ في تحميل ملف النص: {error}
