Repository: hibataha0/filevo
Catalog: lib/l10n/intl_*.arb
Languages: ar

# folderCreatedSuccessfully
source: Folder created successfully: {folderName}
ar: تم إنشاء المجلد بنجاح: {folderName}

source: Failed to create folder
ar: فشل إنشاء المجلد

source: All Activities
ar: جميع الأنشطة

# userLabel
source: User
ar: المستخدم

# roomLabel
source: Room
ar: الغرفة

source: No files
ar: لا توجد ملفات

# startAddingFiles
source: Start adding new files
ar: ابدأ بإضافة ملفات جديدة

# fileRemovedFromRoom
source: File removed from room successfully
ar: تم إزالة الملف من الغرفة بنجاح

# failedToRemoveFile
source: Failed to remove file from room
ar: فشل إزالة الملف من الغرفة

source: File moved successfully
ar: تم نقل الملف بنجاح

source: Failed to move file
ar: فشل نقل الملف

source: Root
ar: الجذر

# moveToRootDescription
source: Move folder to main folder
ar: نقل المجلد إلى المجلد الرئيسي

# selectFolderDescription
source: Move to this folder
ar: نقل إلى هذا المجلد

source: No folders available
ar: لا توجد مجلدات متاحة

source: No subfolders
ar: لا توجد مجلدات فرعية

source: Error loading subfolders
ar: خطأ في تحميل المجلدات الفرعية

source: Open
ar: فتح

source: View Details
ar: عرض التفاصيل

source: Remove from Favorites
ar: إزالة من المفضلة

source: Add to Favorites
ar: إضافة إلى المفضلة

source: Remove from Room
ar: إزالة من الغرفة

source: View Info
ar: عرض المعلومات

source: Move
ar: نقل

source: Failed to extract text from PDF
ar: فشل استخراج النص من PDF

# canViewPdfAndSearch
source: You can view PDF and search in it
ar: يمكنك عرض PDF والبحث فيه

source: ✅ Image edited successfully
ar: ✅ تم تعديل الصورة بنجاح

source: ⚠️ Edited image is empty
ar: ⚠️ الصورة المعدلة فارغة

source: ⚠️ Failed to save edited image
ar: ⚠️ فشل حفظ الصورة المعدلة

# textEditedSuccessfully
source: ✅ Text edited successfully. Press "Save Changes" to upload to server
ar: ✅ تم تعديل النص بنجاح. اضغط على "حفظ التغييرات" لرفعه على السيرفر

source: Save Options
ar: خيارات الحفظ

# saveOptionsDescription
source: How do you want to save the edited image? • Save new copy: The edited image will be saved as a new file • Replace old version: The old file will be deleted and replaced with the edited image
ar: كيف تريد حفظ الصورة المعدلة؟ • حفظ نسخة جديدة: سيتم حفظ الصورة المعدلة كملف جديد • استبدال النسخة القديمة: سيتم حذف الملف القديم واستبداله بالصورة المعدلة

source: Save new copy
ar: حفظ نسخة جديدة

source: Replace old version
ar: استبدال النسخة القديمة

source: Extract
ar: استخراج

source: Trim Audio
ar: قص الصوت

# totalDuration
source: Total duration: {duration}
ar: المدة الكلية: {duration}

source: Trim
ar: قص

source: Adjust Volume
ar: تعديل مستوى الصوت

source: Apply
ar: تطبيق

source: Convert Format
ar: تحويل الصيغة

source: Choose output format:
ar: اختر صيغة الإخراج:

# wavDescription
source: High quality, large size
ar: جودة عالية، حجم كبير

# mp3Description
source: Good quality, small size
ar: جودة جيدة، حجم صغير

# aacDescription
source: Very good quality
ar: جودة جيدة جداً

source: Add Text (Annotation)
ar: إضافة نص (Annotation)

# positionX
source: Position X: {x}
ar: الموضع X: {x}

# positionY
source: Position Y: {y}
ar: الموضع Y: {y}

# fontSize
source: Font size: {size}
ar: حجم الخط: {size}

# page
source: Page: {pageNumber}
ar: الصفحة: {pageNumber}

source: Add
ar: إضافة

source: Select Image Position
ar: تحديد موضع الصورة

# width
source: Width: {width}
ar: العرض: {width}

# height
source: Height: {height}
ar: الارتفاع: {height}

source: Highlight Text
ar: تظليل النص (Highlight)

source: Color:
ar: اللون:

source: Highlight
ar: تظليل

source: File not found
ar: الملف غير موجود: {fileName}

source: Saving file...
ar: جاري حفظ الملف...

# fileSavedToAccount
source: File saved to your account
ar: ✅ تم حفظ الملف في حسابك بنجاح

# errorOccurred
source: ❌ Error: {error}
ar: ❌ خطأ: {error}

# errorLoadingFileData
source: Error loading file data: {error}
ar: حدث خطأ في تحميل بيانات الملف: {error}

source: ✅ Image extracted successfully
ar: ✅ تم استخراج الصورة بنجاح

source: ✅ Video edited successfully
ar: ✅ تم تعديل الفيديو بنجاح

source: ⚠️ Edited video is empty
ar: ⚠️ الفيديو المعدل فارغ

source: ⚠️ Failed to save edited video
ar: ⚠️ فشل حفظ الفيديو المعدل

# videoMergedSuccessfully
source: ✅ Videos merged successfully
ar: ✅ تم دمج المقاطع بنجاح

# pdfLoadFailed
source: Failed to load PDF file ({statusCode})
ar: فشل تحميل ملف PDF ({statusCode})

source: ✅ Text added successfully
ar: ✅ تم إضافة النص بنجاح

source: ✅ Image added successfully
ar: ✅ تم إضافة الصورة بنجاح

source: ✅ Text highlighted successfully
ar: ✅ تم تظليل النص بنجاح

source: ✅ File updated successfully
ar: ✅ تم تحديث الملف بنجاح

source: ✅ File replaced successfully
ar: ✅ تم استبدال الملف بنجاح

source: ✅ New copy saved successfully
ar: ✅ تم حفظ النسخة الجديدة بنجاح

source: Changes saved successfully
ar: ✅ تم حفظ التغييرات بنجاح

source: Save Changes
ar: حفظ التعديلات

source: Choose from Gallery
ar: اختر من المعرض

source: Take Photo from Camera
ar: التقط صورة من الكاميرا

source: Delete Folder
ar: حذف المجلد

source: Confirm Permanent Delete
ar: تأكيد الحذف النهائي

source: Permanent Delete
ar: حذف نهائي

source: Open File
ar: فتح الملف

source: Open Folder
ar: فتح المجلد

# editedFileNotFound
source: Edited file not found. Please edit again
ar: الملف المعدل غير موجود. يرجى إعادة التعديل

# errorAccessingEditedFile
source: Error accessing edited file: {error}
ar: خطأ في الوصول للملف المعدل: {error}

# selectFolder
source: Select "{folderName}"
ar: اختيار "{folderName}"

source: Folder moved successfully
ar: ✅ تم نقل المجلد بنجاح

# folderIdNotFound
source: Error: Folder ID not found
ar: خطأ: معرف المجلد غير موجود

# failedToFetchFolderInfo
source: Failed to fetch folder information
ar: فشل جلب معلومات المجلد

# mustLoginFirstError
source: You must login first
ar: خطأ: يجب تسجيل الدخول أولاً

source: Must allow photos access
ar: يجب السماح بالوصول إلى الصور

source: ✅ Profile image uploaded successfully
ar: ✅ تم رفع صورة الملف الشخصي بنجاح

source: ❌ Failed to upload profile image
ar: ❌ فشل رفع صورة الملف الشخصي

# errorUploadingProfileImage
source: ❌ Error uploading profile image: {error}
ar: ❌ خطأ في رفع صورة الملف الشخصي: {error}

source: Must allow camera access
ar: يجب السماح بالوصول إلى الكاميرا

source: Unknown error
ar: خطأ غير معروف

source: Edit File Metadata
ar: تعديل الملف

source: File Name
ar: اسم الملف

# fileDescription
source: Description
ar: الوصف

# tagsSeparatedByComma
source: Tags (separate by comma)
ar: الوسوم (افصل بينها بفاصلة)

# changesSaveFailed
source: Failed to save changes
ar: ❌ فشل حفظ التعديلات

# confirmDeleteFile
source: Are you sure you want to delete '{fileName}'?
ar: هل أنت متأكد من حذف الملف '{fileName}'؟

# noTokenError
source: No token available
ar: ❌ خطأ: لا يوجد توكن.

# fileDeletedSuccessfully
source: File '{fileName}' deleted successfully
ar: ✅ تم حذف الملف '{fileName}' بنجاح

# errorDeletingFile
source: Error deleting file: {error}
ar: ❌ حدث خطأ أثناء حذف الملف: {error}

# noUsersSharedWith
source: No users to unshare with
ar: لا يوجد مستخدمون مشارك معهم الملف

source: Cannot identify users
ar: لا يمكن تحديد المستخدمين لإلغاء المشاركة

# unshareFileSuccess
source: File unshared successfully
ar: ✅ تم إلغاء مشاركة الملف

# unshareFailed
source: Failed to unshare file
ar: فشل إلغاء المشاركة

source: File added to favorites
ar: ✅ تم إضافة الملف إلى المفضلة

source: File removed from favorites
ar: ✅ تم إزالة الملف من المفضلة

# errorUpdating
source: Failed to update
ar: ❌ حدث خطأ أثناء التحديث

source: Downloading file...
ar: جاري تحميل الملف...

# fileDownloadedSuccessfully
source: File '{fileName}' downloaded successfully
ar: ✅ تم تحميل الملف بنجاح: {fileName}

source: Failed to download file
ar: فشل تحميل الملف

# errorDownloadingFile
source: Error downloading file: {error}
ar: ❌ خطأ في تحميل الملف: {error}

source: Cannot identify file
ar: لا يمكن تحديد الملف

# shareRequestSent
source: ✅ Share request sent to room
ar: ✅ تم إرسال طلب المشاركة للغرفة

# confirmDeleteFolder
source: Are you sure you want to delete the folder '{folderName}'? All files and subfolders will also be deleted.
ar: هل أنت متأكد من حذف المجلد '{folderName}'؟ سيتم حذف جميع الملفات والمجلدات الفرعية أيضاً.

# folderDeletedSuccessfully
source: ✅ Folder '{folderName}' deleted successfully
ar: ✅ تم حذف المجلد '{folderName}' بنجاح

# errorDeletingFolder
source: ❌ Error occurred while deleting folder
ar: ❌ حدث خطأ أثناء حذف المجلد

# errorDeletingFolderWithError
source: ❌ Error occurred while deleting folder: {error}
ar: ❌ حدث خطأ أثناء حذف المجلد: {error}

# folderRestoredSuccessfully
source: ✅ Folder '{folderName}' restored successfully
ar: ✅ تم استعادة المجلد '{folderName}' بنجاح

# errorRestoringFolder
source: ❌ Error occurred while restoring folder
ar: ❌ حدث خطأ أثناء استعادة المجلد

# errorRestoringFolderWithError
source: ❌ Error occurred while restoring folder: {error}
ar: ❌ حدث خطأ أثناء استعادة المجلد: {error}

# confirmPermanentDeleteFolder
source: Are you sure you want to permanently delete the folder '{folderName}'? This action cannot be undone. All files and subfolders will be permanently deleted.
ar: هل أنت متأكد من الحذف النهائي للمجلد '{folderName}'؟ لا يمكن التراجع عن هذا الإجراء. سيتم حذف جميع الملفات والمجلدات الفرعية نهائياً.

# folderPermanentlyDeletedSuccessfully
source: ✅ Folder '{folderName}' permanently deleted successfully
ar: ✅ تم الحذف النهائي للمجلد '{folderName}' بنجاح

# errorPermanentlyDeletingFolder
source: ❌ Error occurred while permanently deleting folder
ar: ❌ حدث خطأ أثناء الحذف النهائي للمجلد

# errorPermanentlyDeletingFolderWithError
source: ❌ Error occurred while permanently deleting folder: {error}
ar: ❌ حدث خطأ أثناء الحذف النهائي للمجلد: {error}

# cannotIdentifyFolder
source: ❌ Error: Cannot identify folder
ar: ❌ خطأ: لا يمكن تحديد المجلد

source: Downloading folder...
ar: جاري تحميل المجلد...

# folderDownloadedSuccessfully
source: ✅ Folder downloaded successfully: {fileName}
ar: ✅ تم تحميل المجلد بنجاح: {fileName}

source: Failed to download folder
ar: فشل تحميل المجلد

# errorDownloadingFolder
source: ❌ Error downloading folder: {error}
ar: ❌ خطأ في تحميل المجلد: {error}

source: Please enter folder name
ar: الرجاء إدخال اسم المجلد
